/* ******************************************************
 * ;copyright(c) 版权所有，1998-2003微逻辑。保留所有权利。
 * ******************************************************
 * 
 * ******************************************************
 * 文件说明：引导代码
 * 版本号：1.0.0
 * 开发时期：2003-04-04
 * 作者：周兵
 * 修改记录：
 * *******************************************************
 */


.globl  sys_setjmp
.globl  sys_longjmp

	.align
	.text

sys_setjmp:
	mov       r12, #0
	stmia     r0, {r4 - r12, sp, lr}
	mov       r0, #0
	mov       pc, lr

sys_longjmp:
	ldmia     r0!, {r4 - r12, sp, lr}
	movs      r0, r1
	moveq     r0, #1
	mov       pc, lr
